html/20231125T184606--angular-installation__angular_code.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://arvydasg.github.io/org-static-blog/html/rss.xml"
      title="RSS feed for https://arvydasg.github.io/org-static-blog/html">
<title>angular installation</title>
</head>
<body>
<div id="preamble" class="status"></div>
<div id="content">
<div class="post-date">14 Dec 2023</div><h1 class="post-title"><a href="https://arvydasg.github.io/org-static-blog/html/20231125T184606--angular-installation__angular_code.html">angular installation</a></h1>
<nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0f7b936">1. Installation of Angular</a></li>
<li><a href="#orgeb767fb">2. start ng serve</a></li>
</ul>
</div>
</nav>

<div id="outline-container-org0f7b936" class="outline-2">
<h2 id="org0f7b936"><span class="section-number-2">1.</span> Installation of Angular</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Make sure you have nvm installed. To install -</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">curl -o- https://raw.githubusercontent.com/nvm-sh/nvm/v0.39.5/install.sh | bash
source ~/.bashrc
nvm -v.
</pre>
</div>

<p>
Over it install node latest version by:
</p>

<div class="org-src-container">
<pre class="src src-bash">nvm install --lts
nvm use --lts
node -v
</pre>
</div>

<p>
make sure npm is installed by
</p>

<div class="org-src-container">
<pre class="src src-bash">npm -v
</pre>
</div>

<p>
install angular by:
</p>

<div class="org-src-container">
<pre class="src src-bash">npm install -g @angular/cli
ng version
</pre>
</div>

<p>
install project dependencies by:
</p>

<div class="org-src-container">
<pre class="src src-bash">npm install
</pre>
</div>

<p>
Start angular service while in crud folder with ng serve command (or
NODE<sub>OPTIONS</sub>="&#x2013;max<sub>old</sub><sub>space</sub><sub>size</sub>=512" ng serve) if you are low on
system resources. go to <a href="http://localhost:4200/">http://localhost:4200/</a> and you should see a
list of movies.
</p>

<p>
typescript version - <code>tsc -v</code>
</p>

<ul class="org-ul">
<li>Development server</li>
</ul>

<p>
Run <code>ng serve</code> for a dev server. Navigate to `<a href="http://localhost:4200/">http://localhost:4200/</a>`.
The application will automatically reload if you change any of the
source files.
</p>
</div>
</div>

<div id="outline-container-orgeb767fb" class="outline-2">
<h2 id="orgeb767fb"><span class="section-number-2">2.</span> start ng serve</h2>
<div class="outline-text-2" id="text-2">
<p>
you might close the terminal and open it again and try to use ng
serve - it might say node is not found, install it.
</p>

<p>
well that's because NVM somehow forgot which node it was using.
</p>

<p>
so we need to tell NVM once again to use node lt's:
</p>

<div class="org-src-container">
<pre class="src src-bash">nvm use --lts
</pre>
</div>

<p>
after this do node -v and npm -v - it should work once again.
</p>
</div>
</div>
<div class="taglist"><a href="https://arvydasg.github.io/org-static-blog/html/tags.html">Tags</a>: <a href="https://arvydasg.github.io/org-static-blog/html/tag-angular.html">angular</a> <a href="https://arvydasg.github.io/org-static-blog/html/tag-code.html">code</a> </div></div>
<div id="postamble" class="status"></div>
</body>
</html>
